[
  {
    "id": "new_1766951151736",
    "cat": "Poste de Travail",
    "sev": "Moyen",
    "title": "Politiques de mots de passe faibles et Hygiène",
    "desc": "<p>L'utilisation de mots de passe faibles, par défaut, ou réutilisés sur plusieurs comptes est le vecteur d'entrée le plus courant. Cela inclut les comptes de service statiques, les mots de passe admin identiques sur tout le parc, et les équipements laissés avec les identifiants constructeur.</p>",
    "reco": "<ul>\n        <li>Déployer <strong>LAPS (Local Administrator Password Solution)</strong> sur tout le parc.</li>\n        <li>Mettre en place des politiques de mots de passe fines (<strong>FGPP</strong>) pour les comptes privilégiés (longueur > 20 car.).</li>\n        <li>Utiliser un outil de bannissement de mots de passe courants (ex: Azure AD Password Protection).</li>\n        <li>Scanner le réseau pour détecter les identifiants par défaut (imprimantes, iDRAC, etc.).</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055122",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "BadSuccessor (Abus d'attributs de schéma / SDProp)",
    "desc": "<p>Abus d'attributs de liaison hérités ou mal configurés (ex: <code>assistant</code>, <code>secretary</code>, <code>managedBy</code>). Des mécanismes comme <strong>SDProp</strong> peuvent propager des permissions basées sur ces attributs. Un attaquant ayant le droit <code>WriteProperty</code> sur ces champs peut s'octroyer des droits sur des comptes protégés.</p>",
    "reco": "<ul>\n        <li>Auditer les ACLs pour identifier les droits d'écriture sur les attributs de liaison sensibles.</li>\n        <li>Surveiller les modifications sur les objets protégés par <strong>AdminSDHolder</strong>.</li>\n        <li>Nettoyer le schéma AD des attributs obsolètes.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055125",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "Kerberoasting (Ciblage des SPN)",
    "desc": "<p>Attaque visant les comptes de service avec un <strong>SPN</strong>. Un attaquant demande un ticket TGS pour le service, qui est chiffré avec le hash du mot de passe du compte. L'attaquant tente ensuite de casser ce hash hors-ligne (Brute-force) pour trouver le mot de passe en clair.</p>",
    "reco": "<ul>\n        <li>Utiliser des mots de passe complexes (> 25 caractères) pour les comptes de service.</li>\n        <li>Utiliser des <strong>gMSA (Group Managed Service Accounts)</strong>.</li>\n        <li>Forcer le chiffrement Kerberos <strong>AES</strong> via GPO.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055126",
    "cat": "Active Directory",
    "sev": "Moyenne",
    "title": "AS-REP Roasting (Kerberos Pre-Auth Disabled)",
    "desc": "<p>Cible les utilisateurs dont l'option <em>Do not require Kerberos preauthentication</em> est activée. Le contrôleur de domaine envoie un ticket TGT chiffré (AS-REP) sans preuve d'identité. Ce bloc peut être cassé hors-ligne pour retrouver le mot de passe.</p>",
    "reco": "<ul>\n        <li>S'assurer que l'option <em>Do not require Kerberos preauthentication</em> est décochée pour tous.</li>\n        <li>Auditer via PowerShell : <code>Get-ADUser -Filter {DoesNotRequirePreAuth -eq $True}</code>.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055127",
    "cat": "Audit 360",
    "sev": "Élevée",
    "title": "Poisoning LLMNR, NBT-NS et WPAD",
    "desc": "<p>Protocoles de résolution de noms hérités. Un attaquant local peut répondre aux requêtes broadcast (Man-in-the-Middle) via des outils comme <strong>Responder</strong> pour voler des hashs NTLMv2 ou relayer l'authentification.</p>",
    "reco": "<ul>\n        <li>Désactiver <strong>LLMNR</strong> via GPO.</li>\n        <li>Désactiver <strong>NBT-NS</strong> (WINS) sur les cartes réseaux/DHCP.</li>\n        <li>Désactiver la détection proxy <strong>WPAD</strong> et créer une entrée DNS <code>wpad</code> vers 127.0.0.1.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055124",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "Délégation Kerberos sans contrainte (Unconstrained Delegation)",
    "desc": "<p>Configuration risquée où un serveur stocke en mémoire les TGT complets des utilisateurs qui s'y connectent. Si un attaquant compromet un serveur en <strong>Unconstrained Delegation</strong>, il peut voler les TGT des administrateurs et usurper leur identité sur tout le réseau.</p>",
    "reco": "<ul>\n        <li>Migrer vers la <strong>Délégation Contrainte</strong> ou la <strong>RBCD</strong>.</li>\n        <li>Auditer les machines avec l'attribut <code>TRUSTED_FOR_DELEGATION</code>.</li>\n        <li>Activer <em>Account is sensitive and cannot be delegated</em> pour les comptes Admins.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055123",
    "cat": "Active Directory",
    "sev": "Moyenne",
    "title": "Énumération Anonyme et Sessions Nulles (SMB/LDAP)",
    "desc": "<p>Configurations permettant à un attaquant non authentifié de récolter des données. La <strong>Null Session SMB</strong> permet d'énumérer les utilisateurs (RID Cycling). L'<strong>accès anonyme LDAP</strong> permet de dumper l'annuaire complet (utilisateurs, groupes, descriptions).</p>",
    "reco": "<ul>\n        <li>Bloquer l'énumération anonyme LDAP via l'attribut <code>DsHeuristics</code> et GPO.</li>\n        <li>Désactiver les sessions nulles SMB via la clé de registre <code>RestrictAnonymous</code> (valeur 1 ou 2).</li>\n        <li>Vérifier avec des outils comme <code>windapsearch</code>.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951120641",
    "cat": "Active Directory",
    "sev": "Moyen",
    "title": "Mauvaise gestion des droits AD (ACLs, DACL, Groupes)",
    "desc": "<p>Des configurations permissives dans les listes de contrôle d'accès (ACL) créent des chemins d'attaque invisibles (ex: groupes imbriqués, Shadow Admins). Un utilisateur standard avec un droit <code>WriteDacl</code> ou <code>ResetPassword</code> sur un objet sensible peut prendre le contrôle du domaine.</p>",
    "reco": "<ul>\n        <li>Réaliser des audits réguliers des chemins d'attaque avec l'outil <strong>BloodHound</strong>.</li>\n        <li>Appliquer le principe du moindre privilège et nettoyer les membres des groupes à hauts privilèges.</li>\n        <li>Surveiller les modifications des ACLs sur les objets critiques.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055119",
    "cat": "Web",
    "sev": "Élevée",
    "title": "Mouvements Latéraux : Pass-the-Hash & Pass-the-Ticket",
    "desc": "<p>Techniques post-exploitation utilisant des crédentiels volés en mémoire. <strong>Pass-the-Hash (PtH)</strong> réutilise un hash NTLM pour s'authentifier. <strong>Pass-the-Ticket (PtT)</strong> injecte un ticket Kerberos volé (TGT/TGS) pour accéder aux ressources tant que le ticket est valide.</p>",
    "reco": "<ul>\n        <li>Activer <strong>Windows Defender Credential Guard</strong> pour protéger la mémoire LSASS.</li>\n        <li>Utiliser <strong>LAPS</strong> pour randomiser les mots de passe administrateur local et empêcher le déplacement latéral.</li>\n        <li>Restreindre les connexions réseau des comptes locaux via GPO (Deny access to this computer from the network).</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766950733443",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "Attaques par Relais NTLM",
    "desc": "<p>L'attaquant intercepte une authentification NTLM (issue d'un poisoning ou coercition) et la relaie vers un autre serveur cible pour s'y connecter illégitimement. Cette attaque fonctionne si la cible ne requiert pas la signature des paquets.</p>",
    "reco": "<ul>\n        <li>Activer le <strong>SMB Signing</strong> (Require Signing) sur tous les serveurs et postes de travail.</li>\n        <li>Activer le <strong>LDAP Signing</strong> et le <strong>Channel Binding</strong> sur les contrôleurs de domaine.</li>\n        <li>À long terme, désactiver NTLM au profit de Kerberos.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "ad1",
    "cat": "Active Directory",
    "sev": "Critique",
    "title": "ex Zerologon (CVE-2020-1472)",
    "desc": "<p>Une vulnérabilité critique dans le protocole Netlogon permet à un attaquant non authentifié ayant un accès réseau au contrôleur de domaine d'établir un canal sécurisé vulnérable. Cela permet de réinitialiser le mot de passe du compte ordinateur du DC à une valeur vide (chaîne vide).</p>",
    "reco": "<ul><li>Appliquer le correctif de sécurité Microsoft d'août 2020 sur tous les DCs.</li><li>Activer le mode 'Enforcement' via la clé de registre <code>FullSecureChannelProtection</code>.</li></ul>",
    "translations": null
  },
  {
    "id": "ad2",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "ex: Kerberoasting",
    "desc": "<p>Le Kerberoasting permet à un utilisateur authentifié de demander un ticket de service (TGS) pour tout compte ayant un Service Principal Name (SPN). Le ticket reçu est chiffré avec le hash du mot de passe du compte de service, permettant une attaque par force brute hors ligne.</p>",
    "reco": "<ul><li>Utiliser des mots de passe complexes de plus de 25 caractères pour les comptes de service.</li><li>Utiliser des <strong>gMSA (Group Managed Service Accounts)</strong>.</li></ul>",
    "translations": null
  },
  {
    "id": "new_1766951055131",
    "cat": "Audit 360",
    "sev": "Critique",
    "title": "Default Credentials (Identifiants par défaut)",
    "desc": "<p>Utilisation d'identifiants d'usine (ex: <code>admin:admin</code>, <code>root:password</code>) sur des équipements réseaux, serveurs, imprimantes ou applications. C'est souvent la première porte d'entrée pour un attaquant lors d'un scan réseau.</p>",
    "reco": "<ul>\n        <li>Changer systématiquement les mots de passe par défaut lors de la mise en service.</li>\n        <li>Réaliser des scans de vulnérabilités authentifiés pour détecter les identifiants par défaut oubliés.</li>\n        <li>Désactiver les comptes constructeurs non nécessaires.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055132",
    "cat": "Poste de Travail",
    "sev": "Élevée",
    "title": "Hard-coded Credentials (Identifiants codés en dur)",
    "desc": "<p>Présence de mots de passe, clés API ou jetons d'accès écrits directement dans le code source d'applications ou de scripts compilés. Ces secrets sont exposés à toute personne ayant accès au binaire ou au code (ingénierie inverse, décompilation).</p>",
    "reco": "<ul>\n        <li>Utiliser des gestionnaires de secrets (ex: <strong>Azure Key Vault</strong>, <strong>HashiCorp Vault</strong>).</li>\n        <li>Stocker les secrets dans des variables d'environnement, jamais dans le code.</li>\n        <li>Scanner le code source (SAST) pour détecter les secrets avant déploiement.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055133",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "Credential Exposure in Scripts (Mots de passe en clair dans les scripts)",
    "desc": "<p>Stockage de mots de passe en clair dans des scripts (PowerShell, VBS, Batch) souvent utilisés pour monter des lecteurs réseaux ou lancer des tâches planifiées. Ces fichiers sont souvent stockés sur des partages publics (SYSVOL) lisibles par tous.</p>",
    "reco": "<ul>\n        <li>Utiliser les <strong>gMSA (Group Managed Service Accounts)</strong> pour les tâches planifiées.</li>\n        <li>Ne jamais stocker de mots de passe en clair ; utiliser <code>ConvertTo-SecureString</code> ou des coffres-forts de secrets.</li>\n        <li>Auditer les partages SYSVOL et NETLOGON à la recherche de fichiers contenant des chaînes sensibles.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055134",
    "cat": "Audit 360",
    "sev": "Élevée",
    "title": "SMB Signing Disabled (Signature SMB désactivée)",
    "desc": "<p>Lorsque la signature SMB n'est pas forcée, l'intégrité des paquets n'est pas garantie. Cela permet des attaques de type <strong>Man-in-the-Middle</strong> et surtout le <strong>Relais NTLM</strong>, où un attaquant intercepte une connexion pour s'authentifier sur une autre machine.</p>",
    "reco": "<ul>\n        <li>Activer la GPO <em>Microsoft network server: Digitally sign communications (always)</em> sur les serveurs critiques.</li>\n        <li>Activer la signature SMB sur les postes de travail (impact de performance minime aujourd'hui).</li>\n        <li>Bloquer NTLMv1 et v2 à terme.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055135",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "LDAP Signing Disabled (Signature LDAP désactivée)",
    "desc": "<p>Le trafic LDAP non signé vers les contrôleurs de domaine peut être intercepté et relayé. Un attaquant peut relayer une authentification NTLM vers le service LDAP du DC pour effectuer des modifications dans l'annuaire (ajout d'utilisateur, modification de droits).</p>",
    "reco": "<ul>\n        <li>Configurer les contrôleurs de domaine pour exiger la signature LDAP (LdapEnforceChannelBinding).</li>\n        <li>Activer l'audit (Event ID 2889) pour identifier les applications incompatibles avant blocage.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055136",
    "cat": "Poste de Travail",
    "sev": "Critique",
    "title": "NTLMv1 Enabled",
    "desc": "<p>Le protocole NTLMv1 est obsolète et utilise un algorithme de chiffrement très faible (DES). Il est trivial pour un attaquant de casser un hash NTLMv1 ou de le relayer. Sa présence compromet la sécurité de tout le domaine.</p>",
    "reco": "<ul>\n        <li>Forcer l'utilisation de <strong>NTLMv2 uniquement</strong> via GPO : <em>Network security: LAN Manager authentication level</em> (Send NTLMv2 response only. Refuse LM & NTLM).</li>\n        <li>Idéalement, désactiver complètement NTLM pour passer en 100% Kerberos.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055137",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "Insecure GPO Permissions (Permissions GPO non sécurisées)",
    "desc": "<p>Si des utilisateurs non-administrateurs ont des droits d'écriture sur un objet GPO (Group Policy Object), ils peuvent modifier la politique pour déployer des scripts malveillants, créer des comptes admins ou désactiver des sécurités sur l'ensemble du parc informatique.</p>",
    "reco": "<ul>\n        <li>Auditer les ACLs des objets GPO (via PowerView ou PingCastle).</li>\n        <li>Restreindre les droits d'écriture aux seuls <strong>Domain Admins</strong> et <strong>Enterprise Admins</strong>.</li>\n        <li>Surveiller les modifications des GPO.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055138",
    "cat": "Active Directory",
    "sev": "Élevée",
    "title": "Sensitive Data in Group Policies (GPP Passwords)",
    "desc": "<p>Ancienne fonctionnalité (Group Policy Preferences) permettant de définir des mots de passe (admin local, lecteur réseau) via GPO. Ces mots de passe sont stockés chiffrés dans des fichiers XML sur SYSVOL, mais la clé de déchiffrement a été publiée par Microsoft (MS14-025), rendant leur lecture triviale.</p>",
    "reco": "<ul>\n        <li>Scanner SYSVOL pour trouver les fichiers <code>Groups.xml</code>, <code>Services.xml</code>, etc.</li>\n        <li>Supprimer immédiatement ces fichiers XML.</li>\n        <li>Utiliser <strong>LAPS</strong> pour la gestion des administrateurs locaux.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055139",
    "cat": "Audit 360",
    "sev": "Moyenne",
    "title": "Exposed DNS Records (Zone Transfers - AXFR)",
    "desc": "<p>Un serveur DNS mal configuré autorise le transfert de zone (requête AXFR) depuis n'importe quelle IP. Cela permet à un attaquant (même externe) de récupérer la liste complète des sous-domaines et machines du réseau, facilitant la cartographie de l'infrastructure.</p>",
    "reco": "<ul>\n        <li>Configurer les serveurs DNS pour refuser les transferts de zone globaux.</li>\n        <li>N'autoriser les transferts de zone que vers des adresses IP spécifiques (les serveurs DNS secondaires).</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055140",
    "cat": "Audit 360",
    "sev": "Critique",
    "title": "Unrestricted RDP Access (RDP non restreint)",
    "desc": "<p>Le service Bureau à distance (RDP, port 3389) est accessible à tout le monde ("Everyone") ou exposé directement sur Internet. Cible privilégiée pour les attaques Brute-force, le Credential Stuffing et l'exploitation de failles comme BlueKeep.</p>",
    "reco": "<ul>\n        <li>Ne jamais exposer RDP sur Internet (utiliser un VPN ou une passerelle RD Gateway).</li>\n        <li>Restreindre l'accès RDP aux seuls groupes d'administration et IPs de management.</li>\n        <li>Activer l'authentification au niveau du réseau (NLA).</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055141",
    "cat": "Active Directory",
    "sev": "Critique",
    "title": "NTDS.dit Unauthorized Access",
    "desc": "<p>Le fichier <strong>NTDS.dit</strong> est la base de données de l'Active Directory contenant tous les objets et surtout les hashs de mots de passe (KRBTGT, Admins). Un accès non autorisé (via des sauvegardes ou Shadow Copy VSS) permet à l'attaquant de copier la base et de l'extraire hors ligne pour retrouver tous les mots de passe.</p>",
    "reco": "<ul>\n        <li>Restreindre strictement l'accès physique et logique aux Contrôleurs de Domaine (Tier 0).</li>\n        <li>Surveiller la création de clichés instantanés (VSS) sur les DCs.</li>\n        <li>Chiffrer les sauvegardes des contrôleurs de domaine.</li>\n    </ul>",
    "translations": null
  },
  {
    "id": "new_1766951055142",
    "cat": "Audit 360",
    "sev": "Élevée",
    "title": "Weak Admin Tiering Implementation (Tiering faible)",
    "desc": "<p>Absence de séparation des privilèges. Les administrateurs de domaine (Tier 0) se connectent sur des postes de travail standards (Tier 2). Si un poste est compromis, l'attaquant peut voler la session admin (LSASS dump) et compromettre tout le domaine.</p>",
    "reco": "<ul>\n        <li>Implémenter le modèle de <strong>Tiering</strong> (T0, T1, T2).</li>\n        <li>Utiliser des <strong>PAW (Privileged Access Workstations)</strong> pour l'administration.</li>\n        <li>Configurer des GPO "Deny Logon" pour empêcher les Admins T0 de se connecter sur des machines T1/T2.</li>\n    </ul>",
    "translations": null
  }
]
